app/controllers/items_controller.rb

SELECT * FROM "items" WHERE ("items"."menu_id" = 1) LIMIT 1
---
  def index
    @items = Item.find_all_by_menu_id(@menu.id)

INSERT INTO "items" ("name", "created_at", "updated_at", "menu_id", "description") VALUES('Spring Roll', '2009-12-13 04:42:09', '2009-12-13 04:42:09', NULL, 'A tasty snack we''ll give you for free if you show us your facebook. ')
---
  def create
    @item = Item.new(params[:item])
    respond_to do |format|
      if @item.save

SELECT * FROM "items" WHERE ("items"."id" = 4)
DELETE FROM "items" WHERE "id" = 4
---
  def destroy
    @item = Item.find(params[:id])
    @item.destroy

SELECT * FROM "menus" WHERE ("menus"."id" = 1)
---
  def find_menu
    @menu = Menu.find(params[:menu_id]) unless params[:menu_id].blank?